{
  "backend/main.mo": "Motoko backend actor handling lead submission, user profiles, and admin-restricted lead queries with integrated authorization.",
  "feature_evidence.json": "Machine-generated feature evidence report mapping implemented features to files, components, and tests.",
  "frontend-file-summaries.txt": "Text file containing summarized descriptions of all frontend components and pages.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color variables and light/dark theme support.",
  "frontend/index.html": "Root HTML document mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration and top-level routes using the SiteLayout wrapper.",
  "frontend/src/components/site/PricingPlanCard.tsx": "Reusable pricing card component showing plan details, features, price, and CTA button with optional highlight state.",
  "frontend/src/components/site/ResourceList.tsx": "Displays a grid of downloadable resources with icons, descriptions, and file type indicators.",
  "frontend/src/components/site/routes.ts": "Defines route paths and corresponding display labels for site navigation.",
  "frontend/src/components/site/Seo.tsx": "Sets dynamic page title and meta description on render for SEO.",
  "frontend/src/components/site/ServiceCard.tsx": "Reusable service card showing an optional icon, title, description, and optional CTA action.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the site footer with brand info, navigation links, legal text, and a copyright note.",
  "frontend/src/components/site/SiteHeader.tsx": "Provides a responsive site header with branding, navigation links, and a mobile menu toggle.",
  "frontend/src/components/site/SiteLayout.tsx": "Wraps pages with a header, footer, and main content area using React Router's Outlet.",
  "frontend/src/components/site/StepsTimeline.tsx": "Displays a vertical or horizontal timeline of steps with numbers, titles, and descriptions.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the authenticated or anonymous backend actor, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching leads ordered by timestamp, name, or filtered by business stage.",
  "frontend/src/hooks/useSubmitLead.ts": "Exposes a mutation to submit a lead and invalidates related lead queries on success.",
  "frontend/src/index.css": "Configures Tailwind and custom Saudi-themed color variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with mission, vision, and platform value sections using icons and styled layouts.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with lead submission logic and a thank-you state after successful submission.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, trust indicators, and feature highlights, including navigation buttons.",
  "frontend/src/pages/HowItWorksPage.tsx": "Shows a three-step business setup process with benefits and a call-to-action section.",
  "frontend/src/pages/MentorshipNetworkingPage.tsx": "Provides information on mentorship and networking offerings with mentor benefits and a contact CTA.",
  "frontend/src/pages/PricingPage.tsx": "Renders pricing plans with monthly/yearly toggle, enterprise options, and pay-per-service items using plan cards and SEO setup.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays categorized downloadable resources including templates, checklists, guides, and knowledge base articles with SEO metadata.",
  "frontend/src/pages/ServicesPage.tsx": "Lists core service offerings as cards with descriptions and a CTA to contact, including SEO and an additional expert-help section.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters, including hash query support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the project’s styling system.",
  "project_state.json": "Defines project metadata, requirements, features, design notes, and image needs for the Saudi Business Launchpad platform."
}